#include "supermarket.h"

// 27.07 - создать класс, разобраться с файлыми                                                     ✅                                
// 29.08 - переделать класс, придумать реализацию вывода сразу с объектом, убрать SWITCH            ✅
// 30.08 - 31.08 - придумать реализацию оплаты                                                      ✅
// 30.08 - реализацию инвентаря (купленные товары)                                                  ✅
// 10.09 - реализацию истории операций                                                              ✅
// 02.09 - начальный счет балнса, недостаточно средств и т.д.                                       ✅
// XX.XX - функция продажи товара                                                                   ❌
// 02.09 - сортировка инвентаря по убыванию         -146 строчка                                    ✅
// XX.XX - сделать код более продуманнее                                                            ❌

int main() 
{
    menu();

    return 0;
}
