#include "supermarket.h"

// 27.07 - создать класс, разобраться с файлыми                                                     ✅                                
// 29.08 - переделать класс, придумать реализацию вывода сразу с объектом, убрать SWITCH            ✅
// 30.08 - 31.08 - придумать реализацию оплаты                                                      ❌
// 30.08 - реализацию инвентаря (купленные товары)                                                  ✅
// XX.XX - реализацию истории операций                                                              ❌
// XX.XX - начальный счет балнса, недостаточно средств и т.д.                                       ❌
// XX.XX - функция продажи товара                                                                   ❌

int main() 
{
    menu();

    return 0;
}
